---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
Marble Properties
Marble Class See Also Send Feedback
---

The Marble type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | MarbleColor1 | The property labeled "Stone Color" from the "Marble" schema. |
|  | MarbleColor2 | The property labeled "Vein Color" from the "Marble" schema. |
|  | MarbleSize | The property labeled "Vein Spacing" from the "Marble" schema. |
|  | MarbleWidth | The property labeled "Vein Width" from the "Marble" schema. |
|  | TextureAngle | The property labeled "Angle" from the "Marble" schema. |
|  | TextureLinkTextureTransforms | The property labeled "Link Transforms" from the "Marble" schema. |
|  | TextureRealWorldOffsetX | The property labeled "Offset X" from the "Marble" schema. |
|  | TextureRealWorldOffsetY | The property labeled "Offset Y" from the "Marble" schema. |
|  | TextureRealWorldOffsetZ | The property labeled "Offset Z" from the "Marble" schema. |

# See Also

Marble Class

Autodesk.Revit.DB.Visual Namespace